docs: update disaster-recovery diagram
